Revit 2027 API
PrintParameters.Zoom Property
 The zoom value to a percentage of the original size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Zoom { get; set; }
Public Property Zoom As Integer
	Get
	Set
public:
property int Zoom {
	int get ();
	void set (int value);
}
member Zoom : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if current ZoomType is not Zoom type.
ArgumentOutOfRangeException |  Thrown if input zoom value less than 1.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace